#!/usr/bin/env python
# -*- coding:utf-8 -*-

#输入某年某月某日，判断这一天是这一年的第几天？
y = int(input('请输入年份：'))
m = int(input('请输入月份：'))
d = int(input('请输入日：'))

#dict1 = {'1':'31','2':'29','3':'31','4':'30','5':'31','6':'30','7':'31','8':'31','9':'30','10':'31','11':'30','12':'31'}
#dict2 = {'1':'31','2':'28','3':'31','4':'30','5':'31','6':'30','7':'31','8':'31','9':'30','10':'31','11':'30','12':'31'}
dict1 = {1:31,2:29,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}
dict2 = {1:31,2:28,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}  #字典中 如果key或者value含数字的 最好不要带引号

if y % 400 ==0:
	data1 = 0
	for i in range(1, m):
		data1 = data1 + dict1[i]
	print('您输入的是闰年，日期是这年的第%s天'%(data1+d))

else:
	data1 = 0
	for i in range(1, m):
		data1 = data1 + dict2[i]
	print('您输入的是平年，日期是这年的第%s天' % (data1 + d))
